ajshort.include-autocomplete
cheshirekow.cmake-format
cschlosser.doxdocgen
dokca.42-ft-count-line
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
github.vscode-github-actions
guyutongxue.cpp-reference
ionutvmi.path-autocomplete
kube.42header
llvm-vs-code-extensions.vscode-clangd
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ritwickdey.liveserver
svelte.svelte-vscode
twxs.cmake
vintharas.learn-vim
